/*
高精度小数,输入两个数a和b
10 <= a < b < 100
计算a/b。精确到小数点后200位
如果结果是有限位小于200位那就输出完即可
*/

#include <stdio.h>

int main()
{
	int a, b;
	scanf("%d/%d", &a, &b);
	if (a<b && a>=10 && b<100)
	{
		int x = 0;  // x用来存储每次除完后的商
		int y = 0;  // y用来存储每次除完后的余数
		int i = 0;  // i用来记录当前结果到小数点后第多少位
		printf("0.");
		// 先做一次循环内的else 因为第一次相除后的余数的10倍肯定大于除数
		x = a * 10 / b;
		y = a * 10 % b;
		i++;
		printf("%d", x);
		// 只要余数不等于零就继续循环
		while (y != 0)
		{
			if (10 * y < b)  // 如果余数的10倍还小于除数
			{
				x = 0;  // 商直接为0
				y *= 10;  // 余数变为原来的十倍然后继续
			}
			else
			{
				x = 10 * y / b;
				y = 10 * y % b;
			}
			i++;  // 每除一次i加一
			printf("%d", x);
			if (i == 200)  // 终止条件，精确到小数点后200位时结束循环
			{
				break;
			}
		}
		printf("\n");
	}
	return 0;
}
